{
    "es": {
        "profile": {
            "rol": "Desarrollador Front End",
            "description1": "Hola, soy Nicolas orellana. Construyo soluciones y soluciono problemas.",
            "description2": "Soy Desarrollador Front-end con un sólido trasfondo en Soporte Técnico L1. Mi día a día se divide en dos pasiones: escribir código limpio y eficiente para crear interfaces increíbles, y diagnosticar problemas técnicos para que todo funcione como debe.",
            "description3": "Mi experiencia en soporte me enseñó algo vital para el desarrollo: la empatía con el usuario. No solo busco que una web se vea bien, sino que sea funcional, accesible y libre de errores. Si hay un bug, lo encuentro; si hay una idea, la programo."
        },

        "skill": {
            "first-skill-title": "Front End",
            "skill-years": "Años de experiencia",
            "second-skill-title": "Diseño",
            "third-skill-title": "Multimedia",
            "four-skill-title": "Back End",
            "five-skill-title": "Sistemas Operativos",
            "six-skill-title": "Heramientas"
        },

        "experience": {
            "title": "Experiencias",
            "first-job-dates": "Nov 15 Actualidad",
            "first-job-title": "Operador",
            "first-job-description": "Brindo soporte tecnico nivel 1 para el area tecnica de telecentro.",
            "second-job-dates": "Dic 23 Actualidad",
            "second-job-title": "Desarrollador Front End",
            "second-job-description": "Realizando desarrollo web."       
        },

        "hobbie": {
            "title": "Pasatiempo",
            "first-hobbie-title": "Gym",
            "first-hobbie-description": "Entrenamiento con pesas.",
            "second-hobbie-title": "Gaming",
            "second-hobbie-description": "Probar nuevas experiencias.",       
            "third-hobbie-title": "Futbol",
            "third-hobbie-description": "Jugar con amigos.",     
            "four-hobbie-title": "Conducir",
            "four-hobbie-description": "Disfrutar de la experiencia de manejar."     
        },

        "projects": {
            "first-project-title": "Portafolio Personal - Nicolas Orellana ¡Bienvenido a mi portafolio profesional! ",
            "first-project-dates1": "💻 Portafolio Personal - Nicolas Orellana ¡Bienvenido a mi portafolio profesional! Este proyecto es una Single Page Application (SPA) estática, diseñada para mostrar mi trayectoria como desarrollador, mis habilidades técnicas y los proyectos más destacados que he realizado.",
            "first-project-dates2": "🚀 Características Principales Diseño Responsivo: Adaptado completamente para dispositivos móviles, tablets y escritorio.",
            "first-project-dates3": "Modo Oscuro/Claro: Selector de tema dinámico para mejorar la experiencia de usuario.",
            "first-project-dates4": "Personalización de Colores: Sistema de cambio de acento de color (Azul, Verde, Púrpura, Rojo) mediante variables CSS.",
            "first-project-dates5": "Soporte Multi-lenguaje: Preparado para soporte bilingüe (Español/Inglés).",
            "first-project-dates6": "Secciones Detalladas:",
            "first-project-dates7": "Perfil: Información de contacto y redes sociales.",
            "first-project-dates8": "Experiencia: Historial laboral en soporte técnico y desarrollo.",
            "first-project-dates9": "Habilidades (Skills): Barras de progreso categorizadas por Front-end, Back-end, Diseño, Multimedia y más.",
            "first-project-dates10": "Proyectos: Galería de trabajos con descripción, etiquetas de tecnologías y enlaces a demos/código.",
            "first-project-dates11": "🛠️ Tecnologías Utilizadas HTML5: Estructura semántica para SEO y accesibilidad.",
            "first-project-dates12": "CSS3: Diseño personalizado utilizando metodologías modernas y variables para los temas.",
            "first-project-dates13": "JavaScript (Vanilla): Lógica para el cambio de temas, colores y manejo de idiomas.",
            "first-project-dates14": "Font Awesome: Iconografía profesional para una interfaz intuitiva.",
            "first-project-button": "Codigo",

            "second-project-title": "Clases Dev </> | Landing Page de Cursos de Programación",
            "second-project-dates1": "Clases Dev </> | Landing Page de Cursos de Programación Esta es una landing page moderna, responsiva y funcional diseñada para promocionar clases particulares de programación online. El proyecto incluye un sistema de captura de clientes (leads) y un panel de administración oculto para gestionar las solicitudes.",
            "second-project-dates2": "🚀 Características Diseño Moderno: Interfaz limpia construida con Tailwind CSS.",
            "second-project-dates3": "Modo Oscuro/Claro: Soporte nativo para cambio de tema (Dark Mode).",
            "second-project-dates4": "Totalmente Responsiva: Adaptada para móviles, tablets y escritorio.",
            "second-project-dates5": "Gestión de Leads: Formulario de contacto que valida y guarda datos en el localStorage del navegador.",
            "second-project-dates6": "Panel Administrativo: Sección protegida por contraseña para visualizar los alumnos interesados.",
            "second-project-dates7": "Sin Dependencias de Servidor: Funciona completamente en el lado del cliente (Client-side).",
            "second-project-dates8": "🛠️ Tecnologías Utilizadas HTML5: Estructura semántica.",
            "second-project-dates9": "Tailwind CSS: Estilizado mediante CDN con configuración personalizada.",
            "second-project-dates10": "JavaScript (Vanilla): Lógica para el manejo de temas, almacenamiento de datos y panel admin.",
            "second-project-dates11": "Font Awesome: Iconografía profesional.",
            "second-project-dates12": "Picsum Photos: Placeholders para imágenes dinámicas.",
            "second-project-dates13": "📂 Estructura del Proyecto El proyecto consta de un único archivo principal:",
            "second-project-dates14": "clasesOnline.html: Contiene la estructura HTML, los estilos de Tailwind y la lógica de JavaScript.",
            "second-project-dates15": "🔑 Acceso Administrativo El sitio cuenta con un panel oculto para que el profesor pueda ver quiénes se han inscrito.",
            "second-project-dates16": "Dirígete al Footer (pie de página).",
            "second-project-dates17": "Haz clic en el enlace pequeño que dice 'Acceso Admin'.",
            "second-project-dates18": "Ingresa las siguientes credenciales:",
            "second-project-dates19": "Usuario: cross Contraseña: dev2026",
            "second-project-dates20": "Nota: Los datos se guardan localmente en tu navegador. Si limpias el historial/caché o cambias de navegador, los registros actuales no aparecerán a menos que se implemente una base de datos real.",
            "second-project-dates21": "© 2026 Clases Dev. Creado para potenciar carreras tecnológicas.",
            "second-project-button": "Codigo",

            "third-project-title": "Estudio Nómada - Diseño de Interiores Premium",
            "third-project-dates1": "Estudio Nómada es una landing page elegante y moderna diseñada para un estudio de interiorismo de alta gama. El proyecto se centra en el 'diseño consciente', combinando una estética minimalista con funcionalidades interactivas avanzadas.",
            "third-project-dates2": "🚀 Características Diseño Responsive: Optimizado para dispositivos móviles, tablets y escritorio.",
            "third-project-dates3": "Modo Oscuro (Dark Mode): Incluye un conmutador de modo claro/oscuro con persistencia en localStorage.",
            "third-project-dates4": "Interfaz de Usuario Premium: Uso de tipografías refinadas (Cormorant Garamond e Inter) y una paleta de colores sofisticada.",
            "third-project-dates5": "Componentes Interactivos:",
            "third-project-dates6": "Menú móvil desplegable.",
            "third-project-dates7": "Efectos de hover dinámicos (escala y paso de escala de grises a color).",
            "third-project-dates8": "Navegación pegajosa (sticky header).",
            "third-project-dates9": "Optimización SEO: Metadatos configurados y estructura semántica de HTML5.",
            "third-project-dates10": "🛠️ Tecnologías Utilizadas HTML5: Estructura semántica.",
            "third-project-dates11": "Tailwind CSS (v3): Framework de utilidades para el diseño rápido y personalizado.",
            "third-project-dates12": "JavaScript (Vanilla): Lógica para el modo oscuro, menú móvil y persistencia de datos.",
            "third-project-dates13": "Font Awesome 6: Iconografía detallada.",
            "third-project-dates14": "Google Fonts: Tipografías personalizadas para un aspecto editorial.",
            "third-project-dates15": "© 2026 Estudio Nomada.",
            "third-project-button": "Codigo",

            "four-project-title": "Cotizador Automático de Proyectos",
            "four-project-dates1": "Sistema web automatizado para la generación de cotizaciones de proyectos de software, impulsado por Inteligencia Artificial (Google Gemini).",
            "four-project-dates2": "📋 Descripción",
            "four-project-dates3": "Este proyecto es una aplicación web que permite a los usuarios solicitar cotizaciones estimadas para diferentes tipos de proyectos (Sitios web, Ecommerce, Apps, etc.). Mediante un formulario interactivo, el sistema recopila los requerimientos del cliente y utiliza la API de Google Gemini para analizar los datos y generar una cotización preliminar detallada, incluyendo precio sugerido, tiempo estimado y entregables.",
            "four-project-dates4": "Además, cuenta con un panel de administración seguro para gestionar las solicitudes recibidas.",
            "four-project-dates5": "✨ Características",
            "four-project-dates6": "Cotización con IA: Integración con Google Gemini para análisis y estimación de costos en tiempo real.",
            "four-project-dates7": "Interfaz Moderna: Diseño responsivo y atractivo utilizando TailwindCSS.",
            "four-project-dates8": "Panel de Administración:",
            "four-project-dates9": "Dashboard con métricas clave.",
            "four-project-dates10": "Listado de cotizaciones con filtros.",
            "four-project-dates11": "Detalle completo de cada solicitud.",
            "four-project-dates12": "Gestión de estados (Nueva, Vista, etc.).",
            "four-project-dates13": "Seguridad: Autenticación de usuarios administradores y protección de rutas.",
            "four-project-dates14": "🛠️ Requisitos Previos",
            "four-project-dates15": "Servidor Web (Apache/Nginx) - Se recomienda XAMPP/WAMP para desarrollo local.",
            "four-project-dates16": "PHP 7.4 o superior.",
            "four-project-dates17": "MySQL / MariaDB.",
            "four-project-dates18": "Una API Key de Google Gemini.",

            "five-project-title": "⚪🔴 El Más Grande - Tienda Oficial Este es un proyecto de E-commerce Landing Page",
            "five-project-dates1": "⚪🔴 El Más Grande - Tienda Oficial Este es un proyecto de E-commerce Landing Page diseñado para la venta de indumentaria deportiva. El sitio cuenta con una interfaz moderna, sistema de pedidos dinámico y un panel de administración integrado para la gestión de solicitudes.",
            "five-project-dates2": "🚀 Características Diseño 100% Responsive: Optimizado para múltiples resoluciones, incluyendo dispositivos móviles específicos (probado en 360x775px).",
            "five-project-dates3": "Estilo Moderno: Construido con Tailwind CSS y Google Fonts (Montserrat).",
            "five-project-dates4": "Sistema de Pedidos: Formulario funcional que captura los datos del cliente y los almacena en memoria (o base de datos SQLite).",
            "five-project-dates5": "Panel de Administración: Acceso restringido para ver las solicitudes de envío en tiempo real.",
            "five-project-dates6": "Mobile-First: Estructura de código pensada primero para la eficiencia en dispositivos móviles.",
            "five-project-dates7": "🛠️ Tecnologías Utilizadas Frontend: HTML5, CSS3, Tailwind CSS, JavaScript (Vanilla).",
            "five-project-dates8": "Iconos: Font Awesome 6.0.",
            "five-project-dates9": "Backend (Propuesto): PHP 8.x para la lógica de servidor.",
            "five-project-dates10": "Base de Datos: SQLite para un almacenamiento ligero y portable.",
            "five-project-button": "Codigo"      
        },

        "footer": {
            "footer-title": "Sobre Mi",
            "footer-title2": "Seguime",
            "footer-info1": "¡Hola! Soy Nicolas Orellana. Construyo soluciones y resuelvo problemas.",
            "footer-info2": "Como Desarrollador Front-end con experiencia en Soporte L1, divido mi tiempo entre dos pasiones: escribir código eficiente para crear interfaces increíbles y diagnosticar fallos técnicos para asegurar que todo funcione a la perfección.",
            "footer-info3": "El soporte me enseñó que la empatía con el usuario es la clave de un buen desarrollo. No solo me preocupa la estética de un sitio; busco que sea funcional, accesible y libre de errores. Si algo falla, lo arreglo; si es una idea, la programo.",
            "footer-rights": "©2025 Nicolas Orellana - Todos los derechos reservados"
        }
    },
    "en": {   
        "profile": {
            "rol": "Developer Front End",
            "description1": "Hi, I'm Nicolas Orellana. I build solutions and solve problems.",
            "description2": "I’m a Front-end Developer with a solid background in L1 Technical Support. My day-to-day is driven by two passions: writing clean, efficient code to build amazing interfaces, and diagnosing technical issues to ensure everything runs smoothly.",
            "description3": "My experience in support taught me something vital for development: user empathy. I don’t just want a website to look good; I want it to be functional, accessible, and bug-free. If there’s a bug, I’ll find it; if there’s an idea, I’ll code it."
        },

        "skill": {
            "first-skill-title": "Front End",
            "skill-years": "Years of experience",
            "second-skill-title": "Design",
            "third-skill-title": "Multimedia",
            "four-skill-title": "Back End",
            "five-skill-title": "Operating Systems",
            "six-skill-title": "Tools"
        },

        "experience": {
            "title": "Experience",
            "first-job-dates": "Nov 15 Present",
            "first-job-title": "Operator",
            "first-job-description": "I provide level 1 technical support for the telecentre technical area.",
            "second-job-dates": "Dic 23 Present",
            "second-job-title": "Front-End Developer",
            "second-job-description": "Carrying out web development."       
        },

        "hobbie": {
            "title": "Hobbie",
            "first-hobbie-title": "Gym",
            "first-hobbie-description": "Weight training.",
            "second-hobbie-title": "Gaming",
            "second-hobbie-description": "Try new experiences.",       
            "third-hobbie-title": "Futbol",
            "third-hobbie-description": "Play with friends.",     
            "four-hobbie-title": "Drive",
            "four-hobbie-description": "Enjoy the driving experience."     
        },

        "projects": {
            "first-project-title": "Personal Portfolio - Nicolas Orellana Welcome to my professional portfolio!",
            "first-project-dates1": "💻 Personal Portfolio - Nicolas Orellana Welcome to my professional portfolio! This project is a static Single Page Application (SPA), designed to showcase my career as a developer, my technical skills, and the most relevant projects I have completed.",
            "first-project-dates2": "🚀 Key Features Responsive Design: Fully adapted for mobile devices, tablets, and desktop.",
            "first-project-dates3": "Dark/Light Mode: Dynamic theme switcher to improve user experience.",
            "first-project-dates4": "Color Customization: Color accent switching system (Blue, Green, Purple, Red) using CSS variables.",
            "first-project-dates5": "Multi-language Support: Prepared for bilingual support (Spanish/English).",
            "first-project-dates6": "Detailed Sections:",
            "first-project-dates7": "Profile: Contact information and social networks.",
            "first-project-dates8": "Experience: Work history in technical support and development.",
            "first-project-dates9": "Skills: Progress bars categorized by Front-end, Back-end, Design, Multimedia, and more.",
            "first-project-dates10": "Projects: Work gallery with descriptions, technology tags, and links to demos/code.",
            "first-project-dates11": "🛠️ Technologies Used HTML5: Semantic structure for SEO and accessibility.",
            "first-project-dates12": "CSS3: Custom design using modern methodologies and variables for themes.",
            "first-project-dates13": "JavaScript (Vanilla): Logic for switching themes, colors, and language handling.",
            "first-project-dates14": "Font Awesome: Professional iconography for an intuitive interface.",
            "first-project-button": "Code",

            "second-project-title": "Dev Classes </> | Programming Course Landing Page This is a modern,",
            "second-project-dates1": "Dev Classes </> | Programming Courses Landing Page This is a modern, responsive and functional landing page designed to promote private online programming classes. The project includes a lead capture system and a hidden admin panel to manage requests.",
            "second-project-dates2": "🚀 Features Modern Design: Clean interface built with Tailwind CSS.",
            "second-project-dates3": "Dark/Light Mode: Native support for theme switching (Dark Mode).",
            "second-project-dates4": "Fully Responsive: Adapted for mobile, tablets and desktop.",
            "second-project-dates5": "Lead Management: Contact form that validates and saves data in the browser's localStorage.",
            "second-project-dates6": "Admin Panel: Password-protected section to view interested students.",
            "second-project-dates7": "No Server Dependencies: Runs entirely on the client-side.",
            "second-project-dates8": "🛠️ Technologies Used HTML5: Semantic structure.",
            "second-project-dates9": "Tailwind CSS: Styled via CDN with custom configuration.",
            "second-project-dates10": "JavaScript (Vanilla): Logic for theme handling, data storage and admin panel.",
            "second-project-dates11": "Font Awesome: Professional iconography.",
            "second-project-dates12": "Picsum Photos: Placeholders for dynamic images.",
            "second-project-dates13": "📂 Project Structure The project consists of a single main file:",
            "second-project-dates14": "clasesOnline.html: Contains the HTML structure, Tailwind styles and JavaScript logic.",
            "second-project-dates15": "🔑 Admin Access The site features a hidden panel for the teacher to see who has registered.",
            "second-project-dates16": "Go to the Footer.",
            "second-project-dates17": "Click on the small link that says 'Admin Access'.",
            "second-project-dates18": "Enter the following credentials:",
            "second-project-dates19": "User: cross Password: dev2026",
            "second-project-dates20": "Note: Data is saved locally in your browser. If you clear history/cache or change browsers, current records will not appear unless a real database is implemented.",
            "second-project-dates21": "© 2026 Dev Classes. Created to boost tech careers.",
            "second-project-button": "Code",

            "third-project-title": "PNomad Studio - Premium Interior Design",
            "third-project-dates1": "Estudio Nómada is an elegant and modern landing page designed for a high-end interior design studio. The project focuses on 'conscious design', combining a minimalist aesthetic with advanced interactive features.",
            "third-project-dates2": "🚀 Features Responsive Design: Optimized for mobile, tablets, and desktop.",
            "third-project-dates3": "Dark Mode: Includes a light/dark mode toggle with localStorage persistence.",
            "third-project-dates4": "Premium UI: Use of refined fonts (Cormorant Garamond and Inter) and a sophisticated color palette.",
            "third-project-dates5": "Interactive Components:",
            "third-project-dates6": "Dropdown mobile menu.",
            "third-project-dates7": "Dynamic hover effects (scale and grayscale-to-color transition).",
            "third-project-dates8": "Sticky header navigation.",
            "third-project-dates9": "SEO Optimization: Configured metadata and semantic HTML5 structure.",
            "third-project-dates10": "🛠️ Technologies Used HTML5: Semantic structure.",
            "third-project-dates11": "Tailwind CSS (v3): Utility-first framework for rapid, custom design.",
            "third-project-dates12": "JavaScript (Vanilla): Logic for dark mode, mobile menu, and data persistence.",
            "third-project-dates13": "Font Awesome 6: Detailed iconography.",
            "third-project-dates14": "Google Fonts: Custom typography for an editorial look.",
            "third-project-dates15": "© 2026 Estudio Nomada.",
            "third-project-button": "Code",

            "four-project-title": "Automatic Project Estimator",
            "four-project-dates1": "Automated web system for generating software project quotes, powered by Artificial Intelligence (Google Gemini).",
            "four-project-dates2": "📋 Description",
            "four-project-dates3": "This project is a web application that allows users to request estimated quotes for different types of projects (Websites, Ecommerce, Apps, etc.). Through an interactive form, the system gathers customer requirements and uses the Google Gemini API to analyze data and generate a detailed preliminary quote, including suggested price, estimated time, and deliverables.",
            "four-project-dates4": "Additionally, it features a secure admin panel to manage received requests.",
            "four-project-dates5": "✨ Features",
            "four-project-dates6": "AI Quoting: Google Gemini integration for real-time analysis and cost estimation.",
            "four-project-dates7": "Modern Interface: Responsive and attractive design using TailwindCSS.",
            "four-project-dates8": "Admin Panel:",
            "four-project-dates9": "Dashboard with key metrics.",
            "four-project-dates10": "List of quotes with filters.",
            "four-project-dates11": "Full detail of each request.",
            "four-project-dates12": "Status management (New, Viewed, etc.).",
            "four-project-dates13": "Security: Admin user authentication and route protection.",
            "four-project-dates14": "🛠️ Prerequisites",
            "four-project-dates15": "Web Server (Apache/Nginx) - XAMPP/WAMP recommended for local development.",
            "four-project-dates16": "PHP 7.4 or higher.",
            "four-project-dates17": "MySQL / MariaDB.",
            "four-project-dates18": "A Google Gemini API Key.",

            "five-project-title": "⚪🔴 The Biggest - Official Store This is an E-commerce Landing Page project",
            "five-project-dates1": "⚪🔴 El Más Grande - Official Store This is an E-commerce Landing Page project designed for sportswear sales. The site features a modern interface, a dynamic ordering system, and an integrated admin panel for request management.",
            "five-project-dates2": "🚀 Features 100% Responsive Design: Optimized for multiple resolutions, including specific mobile devices (tested on 360x775px).",
            "five-project-dates3": "Modern Style: Built with Tailwind CSS and Google Fonts (Montserrat).",
            "five-project-dates4": "Ordering System: Functional form that captures customer data and stores it in memory (or SQLite database).",
            "five-project-dates5": "Admin Panel: Restricted access to view shipping requests in real-time.",
            "five-project-dates6": "Mobile-First: Code structure designed primarily for efficiency on mobile devices.",
            "five-project-dates7": "🛠️ Technologies Used Frontend: HTML5, CSS3, Tailwind CSS, JavaScript (Vanilla).",
            "five-project-dates8": "Icons: Font Awesome 6.0.",
            "five-project-dates9": "Backend (Proposed): PHP 8.x for server logic.",
            "five-project-dates10": "Database: SQLite for lightweight and portable storage.",
            "five-project-button": "Code"      
        },

        "footer": {
            "footer-title": "About Me",
            "footer-title2": "Follow Me",
            "footer-info1": "Hi! I'm Nicolas Orellana. I build solutions and solve problems.",
            "footer-info2": "As a Front-end Developer with L1 Support experience, I divide my time between two passions: writing efficient code to create incredible interfaces and diagnosing technical issues to ensure everything runs perfectly.",
            "footer-info3": "Support taught me that user empathy is the cornerstone of great development. I don't just care about aesthetics; I strive for functionality, accessibility, and bug-free performance. If it breaks, I fix it; if it’s an idea, I build it.",
            "footer-rights": "©2025 Nicolas Orellana - All rights reserved"
        }
    }
}