{
    "es": {
        "profile": {
            "rol": "Desarrollador Front End",
            "description": "Soy autodidacta, con una fuerte inclinación por el aprendizaje continuo y la resolución de problemas,utilizo mis habilidades paradesarrollar soluciones innovadoras. Apasionado de las nuevas tecnologias y en especial del ecosistema de css y JavaScript."
        },

        "skill": {
            "first-skill-title": "Front End",
            "skill-years": "Años de experiencia",
            "second-skill-title": "Diseño",
            "third-skill-title": "Multimedia",
            "four-skill-title": "Back End",
            "five-skill-title": "Sistemas Operativos",
            "six-skill-title": "Heramientas Ofimaticas"
        },

        "experience": {
            "title": "Experiencias",
            "first-job-dates": "Nov 15 Actualidad",
            "first-job-title": "Operador",
            "first-job-description": "Brindo soporte tecnico nivel 1 para el area tecnica de telecentro.",
            "second-job-dates": "Dic 23 Actualidad",
            "second-job-title": "Desarrollador Front End",
            "second-job-description": "Realizando desarrollo web."       
        },

        "hobbie": {
            "title": "Pasatiempo",
            "first-hobbie-title": "Gym",
            "first-hobbie-description": "Entrenamiento con pesas.",
            "second-hobbie-title": "Gaming",
            "second-hobbie-description": "Probar nuevas experiencias.",       
            "third-hobbie-title": "Futbol",
            "third-hobbie-description": "Jugar con amigos.",     
            "four-hobbie-title": "Conducir",
            "four-hobbie-description": "Disfrutar de la experiencia de manejar."     
        },

        "projects": {
            "first-project-title": "Portafolio Personal - Nicolas Orellana ¡Bienvenido a mi portafolio profesional! ",
            "first-project-dates": " <br>💻 Portafolio Personal - Nicolas Orellana ¡Bienvenido a mi portafolio profesional! Este proyecto es una Single Page Application (SPA) estática, diseñada para mostrar mi trayectoria como desarrollador, mis habilidades técnicas y los proyectos más destacados que he realizado.<br/> <br>🚀 Características Principales Diseño Responsivo: Adaptado completamente para dispositivos móviles, tablets y escritorio.<br/> Modo Oscuro/Claro: Selector de tema dinámico para mejorar la experiencia de usuario. Personalización de Colores: Sistema de cambio de acento de color (Azul, Verde, Púrpura, Rojo) mediante variables CSS. Soporte Multi-lenguaje: Preparado para soporte bilingüe (Español/Inglés). Secciones Detalladas: Perfil: Información de contacto y redes sociales. Experiencia: Historial laboral en soporte técnico y desarrollo. Habilidades (Skills): Barras de progreso categorizadas por Front-end, Back-end, Diseño, Multimedia y más. Proyectos: Galería de trabajos con descripción, etiquetas de tecnologías y enlaces a demos/código.<br/> <br>🛠️ Tecnologías Utilizadas HTML5: Estructura semántica para SEO y accesibilidad.<br/><br/> CSS3: Diseño personalizado utilizando metodologías modernas y variables para los temas.<br/> JavaScript (Vanilla): Lógica para el cambio de temas, colores y manejo de idiomas.<br/> Font Awesome: Iconografía profesional para una interfaz intuitiva.",
            "first-project-button": "Codigo",
            "second-project-title": "Clases Dev </> | Landing Page de Cursos de Programación",
            "second-project-dates": "<br>Clases Dev </> | Landing Page de Cursos de Programación Esta es una landing page moderna, responsiva y funcional diseñada para promocionar clases particulares de programación online. El proyecto incluye un sistema de captura de clientes (leads) y un panel de administración oculto para gestionar las solicitudes.<br/><br>🚀 Características Diseño Moderno: Interfaz limpia construida con Tailwind CSS.<br/>Modo Oscuro/Claro: Soporte nativo para cambio de tema (Dark Mode).Totalmente Responsiva: Adaptada para móviles, tablets y escritorio.Gestión de Leads: Formulario de contacto que valida y guarda datos en el localStorage del navegador. Panel Administrativo: Sección protegida por contraseña para visualizar los alumnos interesados. Sin Dependencias de Servidor: Funciona completamente en el lado del cliente (Client-side).<br/> <br>🛠️ Tecnologías Utilizadas HTML5: Estructura semántica. Tailwind CSS: Estilizado mediante CDN con configuración personalizada. JavaScript (Vanilla): Lógica para el manejo de temas, almacenamiento de datos y panel admin. Font Awesome: Iconografía profesional. Picsum Photos: Placeholders para imágenes dinámicas.<br/><br> 📂 Estructura del  Proyecto El proyecto consta de un único archivo principal:<br/> clasesOnline.html: Contiene la estructura HTML, los estilos de Tailwind y la lógica de JavaScript.<br/> <br>🔑 Acceso Administrativo El sitio cuenta con un panel oculto para que el profesor pueda ver quiénes se han inscrito.<br/> <br> Dirígete al Footer (pie de página).<br/> Haz clic en el enlace pequeño que dice Acceso Admin.<br/> <br> Ingresa las siguientes credenciales:<br/> <br> Usuario: cross Contraseña: dev2026<br/> <br> Nota: Los datos se guardan localmente en tu navegador. Si limpias el historial/caché o cambias de navegador, los registros actuales no aparecerán a menos que se implemente una base de datos real.<br/><br> © 2026 Clases Dev. Creado para potenciar carreras tecnológicas.",
            "second-project-button": "Codigo",
            "third-project-title": "Estudio Nómada - Diseño de Interiores Premium",
            "third-project-dates": "<br>Estudio Nómada es una landing page elegante y moderna diseñada para un estudio de interiorismo de alta gama. El proyecto se centra en el diseño consciente, combinando una estética minimalista con funcionalidades interactivas avanzadas.<br/> <br>🚀 Características Diseño Responsive: Optimizado para dispositivos móviles, tablets y escritorio.<br/>Modo Oscuro (Dark Mode): Incluye un conmutador de modo claro/oscuro con persistencia en localStorage. Interfaz de Usuario Premium: Uso de tipografías refinadas (Cormorant Garamond e Inter) y una paleta de colores sofisticada. Componentes Interactivos: Menú móvil desplegable. Efectos de hover dinámicos (escala y paso de escala de grises a color). Navegación pegajosa (sticky header). Optimización SEO: Metadatos configurados y estructura semántica de HTML5. <br>🛠️ Tecnologías Utilizadas HTML5: Estructura semántica.<br/> Tailwind CSS (v3): Framework de utilidades para el diseño rápido y personalizado. JavaScript (Vanilla): Lógica para el modo oscuro, menú móvil y persistencia de datos. Font Awesome 6: Iconografía detallada. Google Fonts: Tipografías personalizadas para un aspecto editorial. © 2026 Estudio Nomada.",
            "third-project-button": "Codigo",
            "four-project-title": "Cotizador Automático de Proyectos",
            "four-project-dates": "<br>Sistema web automatizado para la generación de cotizaciones de proyectos de software, impulsado por Inteligencia Artificial (Google Gemini).<br/> <br>📋 Descripción<br/> Este proyecto es una aplicación web que permite a los usuarios solicitar cotizaciones estimadas para diferentes tipos de proyectos (Sitios web, Ecommerce, Apps, etc.). Mediante un formulario interactivo, el sistema recopila los requerimientos del cliente y utiliza la API de Google Gemini para analizar los datos y generar una cotización preliminar detallada, incluyendo precio sugerido, tiempo estimado y entregables. Además, cuenta con un panel de administración seguro para gestionar las solicitudes recibidas. <br/>✨ Características<br/> Cotización con IA: Integración con Google Gemini para análisis y estimación de costos en tiempo real. Interfaz Moderna: Diseño responsivo y atractivo utilizando TailwindCSS. Panel de Administración: Dashboard con métricas clave. Listado de cotizaciones con filtros. Detalle completo de cada solicitud. Gestión de estados (Nueva, Vista, etc.). Seguridad: Autenticación de usuarios administradores y protección de rutas. <br/><br>🛠️ Requisitos Previos<br/> Servidor Web (Apache/Nginx) - Se recomienda XAMPP/WAMP para desarrollo local.<br/> PHP 7.4 o superior.<br/> MySQL / MariaDB.<br/> Una API Key de Google Gemini.<br/>",
            "four-project-button": "Codigo",
            "five-project-title": "⚪🔴 El Más Grande - Tienda Oficial Este es un proyecto de E-commerce Landing Page",
            "five-project-dates": "<br>⚪🔴 El Más Grande - Tienda Oficial Este es un proyecto de E-commerce Landing Page diseñado para la venta de indumentaria deportiva. El sitio cuenta con una interfaz moderna, sistema de pedidos dinámico y un panel de administración integrado para la gestión de solicitudes.<br/> <br> 🚀 Características Diseño 100% Responsive: Optimizado para múltiples resoluciones, incluyendo dispositivos móviles específicos (probado en 360x775px).<br/> <br>Estilo Moderno: Construido con Tailwind CSS y Google Fonts (Montserrat). Sistema de Pedidos: Formulario funcional que captura los datos del cliente y los almacena en memoria (o base de datos SQLite). Panel de Administración: Acceso restringido para ver las solicitudes de envío en tiempo real. Mobile-First: Estructura de código pensada primero para la eficiencia en dispositivos móviles.<br/> <br> 🛠️ Tecnologías Utilizadas Frontend: HTML5, CSS3, Tailwind CSS, JavaScript (Vanilla).<br/> Iconos: Font Awesome 6.0. Backend (Propuesto): PHP 8.x para la lógica de servidor. Base de Datos: SQLite para un almacenamiento ligero y portable.",
            "five-project-button": "Codigo"      
        },

        "footer": {
            "footer-title": "Sobre Mi",
            "footer-title2": "Seguime",
            "footer-info": "Me considero un profesional autodidacta con una mentalidad curiosa y una gran capacidad para la autoformación, lo que me permite adaptarme rápidamente a nuevas situaciones y entornos laborales bajo presion.",
            "footer-rights": "©2025 Nicolas Orellana - Todos los derechos reservados"
        }
    },
    "en": {   
        "profile": {
            "rol": "Developer Front End",
            "description": "I am self-taught, with a strong inclination toward continuous learning and problem-solving, using my skills to develop innovative solutions. Passionate about new technologies andespecially the CSS and JavaScript ecosystem."
        },

        "skill": {
            "first-skill-title": "Front End",
            "skill-years": "Years of experience",
            "second-skill-title": "Design",
            "third-skill-title": "Multimedia",
            "four-skill-title": "Back End",
            "five-skill-title": "Operating Systems",
            "six-skill-title": "Office Automation Tools"
        },

        "experience": {
            "title": "Experience",
            "first-job-dates": "Nov 15 Present",
            "first-job-title": "Operator",
            "first-job-description": "I provide level 1 technical support for the telecentre technical area.",
            "second-job-dates": "Dic 23 Present",
            "second-job-title": "Front-End Developer",
            "second-job-description": "Carrying out web development."       
        },

        "hobbie": {
            "title": "Hobbie",
            "first-hobbie-title": "Gym",
            "first-hobbie-description": "Weight training.",
            "second-hobbie-title": "Gaming",
            "second-hobbie-description": "Try new experiences.",       
            "third-hobbie-title": "Futbol",
            "third-hobbie-description": "Play with friends.",     
            "four-hobbie-title": "Drive",
            "four-hobbie-description": "Enjoy the driving experience."     
        },

        "projects": {
            "first-project-title": "Personal Portfolio - Nicolas Orellana Welcome to my professional portfolio!",
            "first-project-dates": "<br>💻 Personal Portfolio - Nicolas Orellana Welcome to my professional portfolio! This project is a static Single Page Application (SPA), designed to showcase my career as a developer, my technical skills, and the most outstanding projects I have completed.<br/><br>🚀 Main Features Responsive Design: Fully adapted for mobile devices, tablets, and desktops.<br/><br> Dark/Light Mode: Dynamic theme selector to enhance the user experience. Color Customization: System for changing accent colors (Blue, Green, Purple, Red) using CSS variables. Multi-Language Support: Ready for bilingual support (Spanish/English). Detailed Sections: Profile: Contact information and social media links. Experience: Work history in technical support and development. Skills: Progress bars categorized by Front-end, Back-end, Design, Multimedia, and more. Projects: Gallery of works with descriptions, technology tags, and links to demos/code.<br/><br> 🛠️ Technologies Used: HTML5: Semantic structure for SEO and accessibility.<br/><br/> CSS3: Custom design using modern methodologies and variables for themes.<br/> JavaScript (Vanilla): Logic for changing themes, colors, and language handling.<br/> <br>Font Awesome: Professional iconography for an intuitive interface.<br/>",
            "first-project-button": "Code",
            "second-project-title": "Dev Classes </> | Programming Course Landing Page This is a modern,",
            "second-project-dates": "<br>Dev Classes </> | Programming Course Landing Page This is a modern, responsive, and functional landing page designed to promote online private programming lessons. The project includes a lead capture system and a hidden admin panel to manage requests.<br/><br>🚀 Features Modern Design: Clean interface built with Tailwind CSS.<br/> <br>Dark/Light Mode: Native support for changing themes (Dark Mode).Fully Responsive: Adapted for mobile phones, tablets, and desktops.Lead Management: Contact form that validates and saves data in the browser's local storage. Admin Panel: Password-protected section to view interested students. No Server Dependencies: Works entirely on the client side.<br/><br>🛠️ Technologies Used HTML5: Semantic structure. Tailwind CSS: Styled using a CDN with custom configuration. JavaScript (Vanilla): Logic for theme management, data storage, and the admin panel. Font Awesome: Professional iconography. Picsum Photos: Placeholders for dynamic images. <br>📂 Project Structure The project consists of a single main file: clasesOnline.html: Contains the HTML structure, Tailwind styles, and JavaScript logic. <br>🔑 Administrative Access The site has a hidden panel so the instructor can see who has enrolled. Go to the Footer. Click on the small link that says Admin Access. Enter the following credentials: Username: cross Password: dev2026 Note: The data is saved locally in your browser. If you clear your history/cache or switch browsers, current logs will not appear unless a real database is implemented.<br> © 2026 Clases Dev. Created to empower tech careers.<br/>",
            "second-project-button": "Code",
            "third-project-title": "PNomad Studio - Premium Interior Design",
            "third-project-dates": "<br>Nomad Studio is an elegant and modern landing page designed for a high-end interior design studio. The project focuses on conscious design, combining a minimalist aesthetic with advanced interactive functionalities. <br/><br>🚀 Features: Responsive Design: Optimized for mobile devices, tablets, and desktops. Dark Mode: Includes a light/dark mode toggle with persistence in localStorage. Premium User Interface: Use of refined typefaces (Cormorant Garamond and Inter) and a sophisticated color palette. Interactive Components: Drop-down mobile menu. Dynamic hover effects (scaling and grayscale-to-color transition). Sticky header navigation. SEO Optimization: Configured metadata and HTML5 semantic structure.<br/> <br>🛠️ Technologies Used: HTML5: Semantic structure. Tailwind CSS (v3): Utility framework for fast and customized design. JavaScript (Vanilla): Logic for dark mode, mobile menu, and data persistence. Font Awesome 6: Detailed iconography. Google Fonts: Custom typefaces for an editorial look. <br/><br>© 2026 Nomada Studio.<br/>",
            "third-project-button": "Code",
            "four-project-title": "Automatic Project Estimator",
            "four-project-dates": "<br>Automated web system for generating software project quotes, powered by Artificial Intelligence (Google Gemini).<br/> <br> informa deco s/s y sei nforma conectarse wifi levanta ok<br>📋 Description<br/> <br>This project is a web application that allows users to request estimated quotes for different types of projects (websites, e-commerce, apps, etc.). Through an interactive form, the system gathers client requirements and uses the Google Gemini API to analyze the data and generate a detailed preliminary quote, including suggested price, estimated time, and deliverables. It also features a secure administration panel to manage received requests.<br/><br>✨ Features<br/> AI-powered quoting: Integration with Google Gemini for real-time cost analysis and estimation. Modern interface: Responsive and attractive design using Tailwind CSS. Administration panel: Dashboard with key metrics. List of quotes with filters. Complete details of each request. Status management (New, Viewed, etc.). Security: Authentication of administrator users and route protection. <br/><br>🛠️ Prerequisites<br/> Web Server (Apache/Nginx) - XAMPP/WAMP is recommended for local development.<br/> PHP 7.4 or higher.<br/><br> MySQL / MariaDB.<br/> A Google Gemini API Key.",
            "four-project-button": "Code",
            "five-project-title": "⚪🔴 The Biggest - Official Store This is an E-commerce Landing Page project",
            "five-project-dates": "<br>⚪🔴 The Biggest - Official Store This is an e-commerce landing page project designed for selling sportswear. The site features a modern interface, a dynamic ordering system, and an integrated admin panel for managing orders.<br/><br> 🚀 Features 100% Responsive Design: Optimized for multiple resolutions, including specific mobile devices (tested at 360x775px).<br/><br> Modern Style: Built with Tailwind CSS and Google Fonts (Montserrat). Ordering System: Functional form that captures customer data and stores it in memory (or an SQLite database). Admin Panel: Restricted access to view shipping requests in real time. Mobile-First: Code structure designed for mobile efficiency.<br/><br> 🛠️ Technologies Used Frontend: HTML5, CSS3, Tailwind CSS, JavaScript (Vanilla).<br/> <br> Icons: Font Awesome 6.0. Backend (Proposed): PHP 8.x for server logic. Database: SQLite for lightweight and portable storage.",
            "five-project-button": "Code"      
        },

        "footer": {
            "footer-title": "About Me",
            "footer-title2": "Follow Me",
            "footer-info": "I consider myself a self-taught professional with a curious mindset and a great capacity for self-education, which allows me to quickly adapt to new situations and work environments under pressure.",
            "footer-rights": "©2025 Nicolas Orellana - All rights reserved"
        }
    }
}